[
  {
    "id": 1,
    "title": "Fourier Forge",
    "description": "An educational mobile application engineered with Flutter that combines complex mathematical algorithms with intuitive UI/UX design. Implemented robust software architecture with CI/CD deployment pipelines on Digital Ocean while applying business analysis methodologies to meet educational stakeholder requirements.",
    "longDescription": "As part of my Final Year Project (FYP), I architected Fourier Forge, a comprehensive educational tool that solves a significant business problem for engineering students struggling with Fourier series calculations. The application implements advanced algorithms and efficient data structures to compute Fourier coefficients while featuring a user-centered design informed by extensive student research and feedback sessions.\n\nThe project showcases my full-stack capabilities: backend development with complex mathematical processing, DevOps practices with automated deployment pipelines to Digital Ocean, and frontend implementation featuring responsive UI components and interactive visualizations. The business analysis component involved stakeholder interviews with educators, requirements documentation, and KPI tracking to ensure the product delivered measurable educational value.",
    "technologies": ["Flutter", "Dart", "UI/UX", "Algorithms ","User Requirements", "Mathematics"],
    "category": "Mobile Development",
    "image": "placeholder-fourier.jpg",
    "verticalVideo": "true",
    "link": "https://fourier-forge-83jn8.ondigitalocean.app/",
    "github": "https://github.com/irfansyakir/fourierforge",
    "presentation": "https://www.canva.com/design/DAGnBB9xZTQ/9eR1Rh2Fj0m0TnD0KXZtbA/view?utm_content=DAGnBB9xZTQ&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h5daedcc0b3",
    "year": "2025",
    "month": "April",
    "challenges": "One of the main challenges was translating complex mathematical formulas into a user-friendly mobile interface while ensuring computational accuracy. Additionally, creating intuitive visualisations that properly illustrate Fourier series signals required significant research and testing.",
    "solutions": "I used Flutter packages to render mathematical equations and to visualise waveforms and signals. These tools allowed me to create accurate, responsive visuals and present Fourier series calculations in clear, step-by-step breakdowns without building custom rendering engines or algorithms.",
    "features": [
      "Step-by-step solution viewer",
      "Waveform visualisation tool",
      "Step-by-step solution generator",
      "Offline mode for studying without internet connection"
    ]
  },
  {
    "id": 2,
    "title": "JamStream",
    "description": "A collaborative full-stack mobile application integrating Spotify's API with Firebase for real-time social music experiences. Applied agile methodologies, modular software architecture patterns, and infrastructure automation while conducting user research to deliver a market-differentiated product meeting both technical and business requirements.",
    "longDescription": "JamStream represents a comprehensive product development initiative spanning engineering, design, and business analysis domains. Working in a team of 9, I contributed to the modular architecture design, implementing a robust state management system using Zustand that facilitated cross-component communication.\n\nFrom a DevOps perspective, we implemented a continuous integration workflow that streamlined testing and deployment across multiple environments. The user experience was crafted through thorough market analysis, persona development, and usability testing that informed our design decisions. Business requirements were translated into technical specifications through a systematic process that included stakeholder workshops, competitive analysis, and feature prioritization based on user impact and technical feasibility.",
    "technologies": ["React Native", "Expo", "User Analysis","JavaScript", "Firebase", "APIs"],
    "category": "Mobile Development",
    "image": "placeholder-jamstream.jpg",
    "verticalVideo": "false",
    "link": "#",
    "github": "https://github.com/irfansyakir/DIP-Group-4",
    "figma": "https://www.figma.com/design/gMIQ6WEVMcx6wvEDuRvBZ2/app-features-rough-draft?node-id=71-3474&t=aEqdiWd3V13V9GxV-1",
    "presentation": "https://www.canva.com/design/DAF0l0OPRkE/E0KnodMlY2rC4AJiKmjdVg/view?utm_content=DAF0l0OPRkE&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=heea38939a8",
    "year": "2023",
    "month": "August",
    "challenges": "Working in a team of 9 presented coordination challenges across different components of the application. Integrating Spotify's API with our custom social features while ensuring all team members could contribute effectively required careful planning and communication. Additionally, building a real-time synchronized listening experience across multiple devices demanded innovative solutions.",
    "solutions": "We implemented a modular architecture with clearly defined responsibilities for each team member. Firebase Realtime Database helped us create responsive social features, while Expo's development environment allowed for consistent testing across different devices. We created custom hooks and state management with Zustand to handle the complex interactions between the music playback and social components.",
    "features": [
      "Genre-specific music chatrooms for real-time music discovery and discussion",
      "User profile customization with music preferences and listening history",
      "Synchronized music streaming for group listening experiences",
      "Track discovery through social recommendations",
      "Cross-platform mobile experience with consistent UI/UX"
    ]
  },
  {
    "id": 3,
    "title": "Imposter Sweeper",
    "description": "An object-oriented Java application implementing the MVC architecture pattern with custom game algorithms and interactive UI components. Demonstrates software engineering principles, version control integration, and user-centered design methodologies targeted at a specific market segment with measurable engagement metrics.",
    "longDescription": "Imposter Sweeper showcases advanced software engineering practices through a Java implementation featuring custom algorithms for game state management and optimized data structures for performance efficiency. The application demonstrates clean architecture with strict separation of concerns using the MVC pattern, allowing for maintainable, testable code.\n\nThe DevOps approach incorporated automated unit testing with continuous integration through GitHub Actions, ensuring stable releases. From a design perspective, the UI elements were created through iterative prototyping based on user testing sessions that identified optimal interaction patterns. The business analysis component included market research on casual gaming demographics and feature prioritization based on user engagement metrics from similar games.",
    "technologies": ["Java", "OOP", "GUI Development", "Game Design"],
    "category": "Game",
    "image": "placeholder-impostersweeper.jpg",
    "link": "#",
    "github": "https://github.com/irfansyakir/OOP-Minesweeper",
    "year": "2023",
    "month": "April",
    "challenges": "Implementing an efficient algorithm for imposter placement and number calculation was challenging, especially when ensuring the first click is always safe. Creating custom death animations and incorporating the Among Us theme while maintaining the core Minesweeper gameplay required balancing visual appeal with game functionality.",
    "solutions": "I used the Model-View-Controller design pattern to separate game logic from the UI. For imposter generation, I implemented a delayed generation algorithm that only places imposters after the first click, ensuring the player always starts with a safe move. Custom animations were implemented using Java's animation libraries.",
    "features": [
      "Multiple difficulty levels (Beginner, Intermediate, Expert)",
      "Custom Among Us-themed graphics and sound effects",
      "Unique death animations when clicking on imposters",
      "Hint system that reveals safe cells",
      "Custom game mode with adjustable board size and imposter count",
      "High score tracking and export functionality"
    ]
  },
  {
    "id": 4,
    "title": "Opus-Cinemas",
    "description": "A full-stack web application built with PHP, MySQL, and JavaScript implementing complex database relationships and real-time transactions. Features secure authentication systems, RESTful API design, and responsive UI components while addressing business requirements for ticket management and revenue optimization.",
    "longDescription": "Opus-Cinemas demonstrates comprehensive software engineering capabilities through a layered architecture that separates data access, business logic, and presentation layers. The backend implements secure authentication, transaction management, and database optimization techniques while the frontend delivers a responsive, accessible user interface with real-time feedback.\n\nThe DevOps implementation included local development environments with XAMPP, version control with feature branching, and automated testing of critical user paths. From a business analysis perspective, we conducted competitor research to identify market gaps and developed a feature roadmap aligned with key performance indicators for user acquisition and retention. The UI/UX design process involved user journey mapping, wireframing, and usability testing to create an intuitive booking flow that maximized conversion rates.",
    "technologies": ["PHP", "MySQL", "JavaScript", "HTML5", "CSS3", "XAMPP"],
    "category": "Web Development",
    "image": "placeholder-opus-cinemas.jpg",
    "verticalVideo": "false",
    "link": "#",
    "github": "https://github.com/irfansyakir/opus-cinemas",
    "year": "2024",
    "month": "October",
    "challenges": "Working with a partner to build a real-time seat reservation system that prevents double bookings while maintaining good performance was particularly challenging. We needed to design a database schema that could efficiently manage relationships between movies, cinemas, showtimes and seat bookings. Creating an intuitive seat selection interface that could represent complex theater layouts while providing visual feedback across different devices also required careful planning and implementation.",
    "solutions": "We implemented a modular architecture that separated business logic from presentation concerns. Our solution included AJAX-based seat availability checks to provide real-time feedback without page refreshes. We designed a normalized database schema with proper foreign key relationships and used prepared statements throughout the application to enhance security. The email notification system uses templates for consistent communication with customers throughout the booking process.",
    "features": [
      "Interactive seat selection with real-time availability updates",
      "User profiles with comprehensive booking history",
      "Detailed movie listings with trailers and information",
      "Secure payment processing with multiple options",
      "Email notifications for booking confirmations",
      "Responsive design optimized for different devices"
    ]
  },
  {
    "id": 7,
    "title": "Bettersweet",
    "description": "A front-end e-commerce platform developed using HTML, CSS, and JavaScript with a focus on conversion optimization and customer engagement. Implements responsive design patterns, interactive UI components, and data-driven user flows while demonstrating brand strategy alignment with target market analysis.",
    "longDescription": "Bettersweet showcases front-end engineering excellence through modular JavaScript components, performance-optimized CSS, and semantic HTML structure. The project implements advanced UI patterns like lazy loading, infinite scroll, and responsive layouts that adapt to diverse device contexts.\n\nFrom a business perspective, the site structure was informed by e-commerce conversion funnel analysis, with optimized product discovery paths and streamlined checkout processes. The design strategy combined branding requirements with UX research findings to create a distinctive visual language that reinforced the premium positioning of the coffee products. My marketing contribution included developing the loyalty program mechanics, subscription model pricing strategy, and customer segmentation approach that targeted different coffee consumption habits.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Bootstrap 5", "UI/UX"],
    "category": "Web Development",
    "image": "placeholder-bettersweet.jpg",
    "link": "https://bettersweet.vercel.app/",
    "github": "#",
    "year": "2024",
    "month": "November",
    "challenges": "Our team faced challenges in designing an intuitive e-commerce experience with multiple product variants while maintaining a static website architecture. Creating UI/UX flows that effectively demonstrated subscription management, shopping cart functionality, and a rewards program without backend processing required creative front-end solutions.",
    "solutions": "We implemented a sliding cart system with simulated product configuration using JavaScript and designed JSON data stores for FAQs, policies, and blog content. Our team created interactive UI elements that provided realistic e-commerce experiences despite the static nature of the site, focusing on responsive design and visual consistency across all pages.",
    "features": [
      "Simulated subscription management UI with pricing options",
      "Dynamic product catalog with filtering capabilities",
      "Interactive rewards program interface",
      "Corporate bulk ordering inquiry system",
      "Responsive design optimized for all devices"
    ]
  },
  {
    "id": 8,
    "title": "Pinnacle Accounting",
    "description": "A corporate website implementing modern front-end architecture with Bootstrap-based responsive design. Features audience-segmented content strategy, conversion-optimized user flows, and technical SEO implementations while addressing business stakeholder requirements for lead generation and brand positioning.",
    "longDescription": "Pinnacle Accounting demonstrates technical implementation excellence through component-based architecture, performance optimization techniques, and cross-browser compatibility testing. The development process incorporated version control with feature branches, automated style linting, and responsive testing across multiple device profiles.\n\nThe project showcases my business analysis capabilities through stakeholder interview documentation, competitive landscape assessment, and target audience segmentation that informed our design decisions. My marketing contributions included developing the value proposition hierarchy, content strategy for different business segments, and conversion optimization for lead generation forms. The design approach balanced professional credibility with approachable messaging to establish trust with diverse business owners from startups to established enterprises.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "Bootstrap 5", "Font Awesome" ,"UI/UX"],
    "category": "Web Development",
    "image": "placeholder-pinnacle.jpg",
    "link": "https://cs2024-website.vercel.app/",
    "github": "#",
    "year": "2024",
    "month": "October",
    "challenges": "Our team faced challenges in organizing complex service information in a way that would resonate with different target audiences (startups vs. enterprises vs. family businesses) while maintaining a cohesive brand experience. Creating a professional yet approachable design that would instill trust in potential accounting clients required careful consideration of UI elements, typography, and content presentation.",
    "solutions": "We implemented a tabbed interface to segment services by business type while maintaining design consistency. Our team used strategic visual hierarchy and white space to make complex service information digestible, and created an interactive testimonial carousel to build trust through client stories. We focused on mobile responsiveness to ensure the professional experience translated across all devices.",
    "features": [
      "Business-specific service package presentation",
      "Interactive testimonial carousel with client success stories",
      "Credentials and certification display section",
      "Problem-solution narrative structure",
      "Responsive design with bootstrap framework"
    ]
  },

  {
    "id": 9,
    "title": "Thinking & Communicating Visually",
    "description": "A creative exploration of visual communication through observational drawing, applying fundamental elements of art and design principles. This course-based project developed skills in perceptual drawing, perspective techniques, figure representation, and visual problem-solving while building a foundation for translating complex ideas into effective visual communication.",
    "longDescription": "This comprehensive drawing-focused project explored the development of creative thinking methodologies through focused observational drawing and art-making processes. Working across multiple mediums including charcoal, graphite, and Chinese ink, I developed technical proficiency in communicating ideas visually through systematic application of fundamental art principles.\n\nThe project progressed through increasingly complex visual challenges, beginning with basic elements of art (line, tone, shape, texture, form) and advancing to spatial representation through 1 and 2-point perspective. I applied these foundations to figure drawing exercises, developing skills in capturing line of action, gesture, proportions, and anatomical landmarks. The curriculum culminated in compositional studies exploring balance, rhythm, pattern, and the effective use of the picture plane to convey specific ideas.\n\nThrough regular critique sessions and iterative development, I cultivated the ability to analyze visual communication critically and systematically improve execution. This project demonstrates my capacity to translate abstract concepts into concrete visual representations, a skill directly applicable to UI/UX design, information visualization, and effective visual storytelling in digital environments.",
    "technologies": ["Drawing Techniques", "Composition", "Perspective", "Figure Drawing", "Visual Elements"],
    "category": "Design",
    "image": "placeholder-visualthinking.jpg",
    "link": "#",
    "github": "#",
    "Final Project" : "https://drive.google.com/drive/folders/1TtZXJhpTUiNrSUT4yO-AtggqbTtib_AT?usp=sharing",
    "year": "2022",
    "month": "December",
    "challenges": "The primary challenge was developing the perceptual skills needed to accurately translate three-dimensional forms to two-dimensional representations. Mastering perspective, proportional relationships, and the effective use of tone to create volume required significant technical practice. Additionally, learning to simplify complex visual information while maintaining essential characteristics demanded both analytical thinking and creative problem-solving.",
    "solutions": "Through systematic practice and focused exercises, I developed a methodical approach to visual problem-solving. Beginning with fundamental elements and progressing to complex compositions allowed for incremental skill development. Regular critique sessions provided valuable feedback that informed technical improvements and conceptual development, ultimately building a comprehensive visual vocabulary for effective communication.",
    "features": [
      "Perceptual drawing studies using observational techniques",
      "Spatial representation using 1 and 2-point perspective",
      "Figure drawing with gesture, proportion, and anatomical accuracy",
      "Volume and form studies through manipulation of light properties",
      "Compositional exercises exploring balance, rhythm, and pattern",
      "Critical analysis and iterative improvement of visual communication"
    ]
  },
   {
    "id": 10,
    "title": "Thinking & Communicating Visually II",
    "description": "An exploration of two-dimensional design fundamentals and color theory through hands-on experimentation with diverse media. Applied principles of visual organization, composition planning, and color harmonies to create effective visual communication while developing technical proficiency in printmaking and painting techniques.",
    "longDescription": "This project focused on developing advanced understanding of visual design language through systematic exploration of two-dimensional design principles and color theory. I mastered fundamental aspects of visual composition by analyzing relationships between design elements including emphasis, harmony, unity, opposition, balance, and the strategic use of negative space.\n\nThe work progressed through a comprehensive study of color theory based on the principles of Joseph Albers and Henri Matisse, applying concepts of color harmonies, atmospheric perspective, and the psychological aspects of warm/cool color relationships. I developed technical skills across multiple mediums including printmaking (lino-cut and etching) and various painting techniques (gouache, watercolor, and acrylic).\n\nThrough structured exercises and critique sessions, I learned to evaluate visual compositions critically and articulate design decisions using proper terminology. The project culminated in a series of finished artworks that demonstrated my ability to solve complex visual problems through deliberate application of design principles, color theory, and technical execution across diverse media. This foundation in visual language directly informs my approach to UI/UX design, visual branding, and effective digital communication strategies.",
    "technologies": ["Color Theory", "Composition", "Printmaking", "Painting", "Visual Organization"],
    "category": "Design",
    "image": "placeholder-visualthinking2.jpg",
    "link": "#",
    "github": "#",
    "finalProject" : "https://www.canva.com/design/DAGDmMwti_k/cQqgdaENWZcMoNSr8iPorA/view?utm_content=DAGDmMwti_k&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h0b4e26d30d",
    "classAssignments" : "https://www.canva.com/design/DAGDl8UBRjg/WurN68dpAmpYDvcUP5FRVg/view?utm_content=DAGDl8UBRjg&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h3bf6567203",
    "classActivities" : "https://www.canva.com/design/DAGDlpBvvzE/ggxF-VrLN9gBckuSSWyc2A/view?utm_content=DAGDlpBvvzE&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h3137deb0b9",
    "year": "2023",
    "month": "April",
    "challenges": "The primary challenge was developing a sophisticated understanding of color relationships and their application in creating visual hierarchy, depth, and emotional impact. Mastering diverse technical skills across printmaking and painting media required adapting to different working processes and material properties. Additionally, learning to analyze and articulate design decisions using proper terminology demanded development of critical thinking skills.",
    "solutions": "I developed a methodical approach to color and composition through extensive experimentation and analysis of successful design examples. By maintaining a detailed process journal documenting technical procedures and outcomes, I built a comprehensive understanding of each medium's capabilities and constraints. Regular participation in critique sessions helped refine my ability to evaluate work objectively and articulate design decisions clearly.",
    "features": [
      "Color harmony studies demonstrating various schemes and relationships",
      "Printmaking techniques including lino-cut and etching processes",
      "Paintings exploring atmospheric perspective and emotional qualities of color",
      "Compositions demonstrating principles of balance, emphasis, and visual hierarchy",
      "Process documentation showing development from concept to finished artwork",
      "Technical experiments with various water-based painting media"
    ]
  },
    {
    "id": 11,
    "title": "Thinking & Communicating Visually III",
    "description": "A product design and development project implementing 3D visualization techniques in digital environments using industry-standard software. Applied conceptual design methodology through systematic analysis of product structure, function, and context while developing skills in 3D modeling, assembly, and photorealistic rendering.",
    "longDescription": "This comprehensive project explored the creative design process for new products and devices through both technical and conceptual frameworks. Working with professional 3D modeling software (Autodesk Inventor and Keyshot), I developed proficiency in digital product visualization from basic part creation to complex assemblies and photorealistic rendering.\n\nThe conceptual framework involved three distinct analytical approaches: syntactic analysis (investigating product structure, components, and materials), pragmatic analysis (examining use functions and ergonomics through user observation), and semantic analysis (exploring how context, form analogies, and emotional qualities are expressed through design).\n\nThe project culminated in the development of original product concepts, beginning with research and analysis of existing products, proceeding through conceptual sketching of deformed objects, and ultimately resulting in the creation of a new designed object. Throughout the process, I learned to visually communicate research data effectively and critically analyze products as communication tools conveying specific ideas and experiences to users.\n\nThis project demonstrates my ability to bridge technical 3D modeling skills with strategic product analysis and creative conceptualization, combining the 'hard' technical skills of digital visualization with the 'soft' skills of user-centered design thinking.",
    "technologies": ["Autodesk Inventor", "Keyshot", "3D Modeling", "Product Design", "User Research"],
    "category": "Design",
    "image": "placeholder-visualthinking3.jpg",
    "finalProject" : "https://www.canva.com/design/DAGnaw2jL_4/hsNfwRjyn0qhX795lrEGdg/view?utm_content=DAGnaw2jL_4&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h3401b9b36b",
    "link": "#",
    "github": "#",
    "year": "2025",
    "month": "November",
    "challenges": "The primary challenge was integrating technical 3D modeling skills with conceptual product analysis methodologies. Learning complex software interfaces while simultaneously developing analytical frameworks for product evaluation required balancing technical execution with strategic thinking. Additionally, translating research insights into concrete design decisions demanded synthesizing data across multiple dimensions of product experience.",
    "solutions": "I developed a systematic workflow that balanced technical skill development with conceptual analysis. By applying a structured methodology (syntactic, pragmatic, semantic) to product research, I created clear pathways from analysis to design decisions. Regular critique sessions with peers helped refine both technical execution and conceptual thinking, while detailed documentation of the design process ensured coherent development from research through final product concepts.",
    "features": [
      "3D product models created in Autodesk Inventor with proper part constraints and assemblies",
      "Photorealistic product renderings using Keyshot materials and lighting techniques",
      "Syntactic analysis documenting product structure, components, and materials",
      "Pragmatic analysis examining user interaction patterns and ergonomic considerations",
      "Semantic analysis exploring contextual meaning and emotional qualities of products",
      "Original product concept development from research through final design visualization"
    ]
  }

]