[
  {
    "id": 1,
    "title": "Fourier Forge",
    "description": "A mobile app designed to solve Fourier series exam questions with step-by-step solutions and visualisations. \n   It applies UI/UX principles, colour theory, complex data structures, and algorithms to deliver an intuitive and efficient user experience.",
    "longDescription": "Fourier Forge is a comprehensive educational tool designed specifically for engineering students struggling with Fourier series calculations. The app breaks down complex mathematical concepts into digestible steps, providing visual representations of waveforms and interactive elements that help users understand the underlying principles. \n It also leverages complex data structures to efficiently manage mathematical expressions and waveform parameters, alongside custom algorithms that dynamically compute Fourier coefficients and render signal transformations.",
    "technologies": ["Flutter", "Dart", "Mathematics"],
    "category": "Mobile Development",
    "image": "placeholder-fourier.jpg",
    "link": "https://fourier-forge-83jn8.ondigitalocean.app/",
    "github": "https://github.com/irfansyakir/fourierforge",
    "year": "2025",
    "challenges": "One of the main challenges was translating complex mathematical formulas into a user-friendly mobile interface while ensuring computational accuracy. Additionally, creating intuitive visualisations that properly illustrate Fourier series signals required significant research and testing.",
    "solutions": "I used Flutter packages to render mathematical equations and to visualise waveforms and signals. These tools allowed me to create accurate, responsive visuals and present Fourier series calculations in clear, step-by-step breakdowns without building custom rendering engines or algorithms.",
    "features": [
      "Step-by-step solution viewer",
      "Waveform visualisation tool",
      "Step-by-step solution generator",
      "Offline mode for studying without internet connection"
    ]
  },
  {
    "id": 2,
    "title": "Opus-Cinemas",
    "description": "A premium movie booking web application featuring real-time seat selection and secure payment processing with multiple options. Users can browse detailed film listings, watch trailers, and receive personalized recommendations based on preferences and viewing history.",
    "longDescription": "Opus-Cinemas is a comprehensive movie booking platform designed to provide a premium cinema experience from the moment users browse for movies. The application focuses on creating a seamless booking experience with attention to visual design and user flow. The system includes a customer-facing booking interface as well as an administrative backend for cinema management.",
    "technologies": ["HTML5", "CSS3", "JavaScript", "PHP", "MySQL", "XAMPP"],
    "category": "Web Development",
    "image": "placeholder-opus-cinemas.jpg",
    "link": "#",
    "github": "https://github.com/irfansyakir/opus-cinemas",
    "year": "2024",
    "challenges": "Building a real-time seat reservation system that prevents double bookings while maintaining good performance was particularly challenging. Additionally, designing an intuitive seat selection interface was difficult due to the need to represent complex theater layouts, handle group seating preferences, and provide visual feedback on seat availability while maintaining responsiveness across different devices and screen sizes.",
    "solutions": "I implemented database features to manage seat availability and used user profiles to track booked tickets and related activity.",
    "features": [
      "Interactive seat selection with real-time availability updates",
      "User Profile dashboard for checking booking history and preferences",
      "Detailed film listings with trailers and reviews",
      "User-friendly interface with intuitive navigation",
      "Email notifications for booking confirmations and reminders"
    ]
  }
]
